In [27]:
#Series和DataFrame的連結

In [28]:
#1:38:20~1:41:00觀念講解 ~ 1:42:30
import numpy as np
import pandas as pd

s1 = pd.Series([0,1], index=['a','b'])
display(s1)
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5,6], index=['f','g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [29]:
#1:42:30
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [30]:
#1:43:50~1:44:45
pd.concat([s1,s2,s3],axis=1)  #由欄(橫的)做連接

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [31]:
#1:47:45
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one','two'])
display(df1)
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three','four'])
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      0     1
c      2     3

In [32]:
pd.concat([df1, df2],axis=1)

   one  two  three  four
a    0    1    0.0   1.0
b    2    3    NaN   NaN
c    4    5    2.0   3.0

In [33]:
pd.concat([df1, df2],axis=1,keys=['台北','台南'])

   台北        台南
  one two three four
a   0   1   0.0  1.0
b   2   3   NaN  NaN
c   4   5   2.0  3.0

In [34]:
#1:50:20
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
display(df1)
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
display(df2)

pd.concat([df1, df2])   #合起來索引為0、1、2、0、0、1，我不想讓它重複，可用下面的方法重新排列索引編號

          a         b         c         d
0 -2.328867 -0.663133 -1.051226  0.588564
1  1.200443  0.938039 -0.377335 -0.111562
2  0.683812  1.392206 -1.506513 -1.387469

          b         d         a
0 -0.259302 -1.489762 -1.317410
1 -0.039357  0.340961 -0.392402

          a         b         c         d
0 -2.328867 -0.663133 -1.051226  0.588564
1  1.200443  0.938039 -0.377335 -0.111562
2  0.683812  1.392206 -1.506513 -1.387469
0 -1.317410 -0.259302       NaN -1.489762
1 -0.392402 -0.039357       NaN  0.340961

In [35]:
#1:52:15~1:52:50    
pd.concat([df1, df2],ignore_index=True) #ignore_index預設=False #索引重新排列

          a         b         c         d
0 -2.328867 -0.663133 -1.051226  0.588564
1  1.200443  0.938039 -0.377335 -0.111562
2  0.683812  1.392206 -1.506513 -1.387469
3 -1.317410 -0.259302       NaN -1.489762
4 -0.392402 -0.039357       NaN  0.340961

In [ ]:
#1:55:40~ #複製20_3
import yfinance as yf
data =yf.download("2330.TW", start="2022-01-01",end="2022-12-31") #近一個月的股票 #2330台積電
tw2330 =  data[["Adj Close"]]  #2:03:16   #Adj Close收盤價
tw2330.columns = ["台積電"]
tw2330

[*********************100%***********************]  1 of 1 completed

                   台積電
Date
2022-01-03  596.844299
2022-01-04  620.490906
2022-01-05  614.815735
2022-01-06  609.140442
2022-01-07  599.681824
...                ...
2022-12-26  441.325226
2022-12-27  441.808655
2022-12-28  436.008057
2022-12-29  431.174286
2022-12-30  433.591217

[246 rows x 1 columns]

In [37]:
data =yf.download("2303.TW", start="2022-01-01",end="2022-12-31") 
tw2303 =  data[["Adj Close"]]
tw2303.columns = ["聯電"]
tw2303

[*********************100%***********************]  1 of 1 completed

                   聯電
Date
2022-01-03  52.592525
2022-01-04  52.260712
2022-01-05  52.343662
2022-01-06  52.011848
2022-01-07  51.928894
...               ...
2022-12-26  37.009628
2022-12-27  36.965462
2022-12-28  36.038013
2022-12-29  35.993847
2022-12-30  35.949688

[246 rows x 1 columns]

In [ ]:
# ~1:58:00
pd.concat([tw2330,tw2303],axis=1) #用欄連結

                   台積電         聯電
Date
2022-01-03  596.844299  52.592525
2022-01-04  620.490906  52.260712
2022-01-05  614.815735  52.343662
2022-01-06  609.140442  52.011848
2022-01-07  599.681824  51.928894
...                ...        ...
2022-12-26  441.325226  37.009628
2022-12-27  441.808655  36.965462
2022-12-28  436.008057  36.038013
2022-12-29  431.174286  35.993847
2022-12-30  433.591217  35.949688

[246 rows x 2 columns]